Revit 2024 API
AnalyticalNodeData Methods
The AnalyticalNodeData type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetAnalyticalNodeData
 Returns AnalyticalNodeData associated with this element, if it exists.
GetConnectionStatus
 Returns the Connection Status for this Analytical Node.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
AnalyticalNodeData Class
Autodesk.Revit.DB.Structure Namespace